app/Controllers/CourierWebhook.php

    private function handlePathao(array $data)
    {
        $shipmentModel = new ShipmentModel();
        $eventModel = new ShipmentEventModel();

        // Get Pathao auth_token/webhook_secret from DB
        $provider = db_connect()->table('courier_providers')->where('name', 'pathao')->get()->getRow();
        $webhookSecret = $provider->webhook_secret ?? null;
        $authToken     = $provider->auth_token ?? null;

        // MAndatory: verify header 'X-PATHAO-Signature' Secret provided by you during integration.check with provider's 'webhook_secret' for security. If not matched, reject the request.
        $incomingSignature = $this->request->getHeaderLine('X-PATHAO-Signature');
        if ($webhookSecret && $incomingSignature !== $webhookSecret) {
            return $this->response->setStatusCode(401)
                ->setHeader('X-Pathao-Merchant-Webhook-Integration-Secret', $webhookSecret)
                ->setBody('Unauthorized');
        }


        // Idempotency check: skip if already exists
        $hash = md5(json_encode($data));
        $existingEvent = $eventModel->where('event_hash', $hash)->first();
        if ($existingEvent) {
            return $this->response->setStatusCode(200)
                ->setHeader('X-Pathao-Merchant-Webhook-Integration-Secret', $webhookSecret);
        }


        // Insert or update shipment
        $shipment = $shipmentModel->where('consignment_id', $data['consignment_id'])->first();
---
SELECT *
FROM `courier_providers`
WHERE `name` = 'pathao'
SELECT *
FROM `shipment_events`
WHERE `event_hash` = 'dc5acb19aa628e7302f1a9acb2f05f3f'
 LIMIT 1
SELECT *
FROM `shipments`
WHERE `consignment_id` = 'DL121224VS8TTJ'
 LIMIT 1

            ]);
        } else {
            $shipmentId = $shipment['id'];
            $shipmentModel->update($shipmentId, [
                'current_status' => $data['event'],
                'updated_at' => $data['updated_at'] ?? date('Y-m-d H:i:s')
            ]);
---
UPDATE `shipments` SET `current_status` = 'order.created', `updated_at` = '2024-12-27 23:49:46'
WHERE `shipments`.`id` IN ('1')